<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"bdb13780808919e0235e6fbf4d0361de24d441f15ef3ad14075ea9a35262edc1","plan_job_ref":"Job Plan org changes and list them in a PR #67 at https://github.com/django-commons/controls/actions/runs/10442729140","plan_out_hash":"9df633acad10b72fe26def225e614ff9829ad48c24fb58e078d731fd31a4350e","plan_hash":"d253b7f35ddc78f8ea97ee542f44bc818fceae12854a0e81a55b4b4133e7554d","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 10 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["django-tasks-scheduler"] will be updated in-place
!~  resource "github_repository" "this" {
        id                          = "django-tasks-scheduler"
!~      merge_commit_message        = "PR_TITLE" -> "PR_BODY"
!~      merge_commit_title          = "MERGE_MESSAGE" -> "PR_TITLE"
        name                        = "django-tasks-scheduler"
#        (35 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_repository.this["playground2"] will be created
+   resource "github_repository" "this" {
+       allow_auto_merge            = false
+       allow_merge_commit          = false
+       allow_rebase_merge          = false
+       allow_squash_merge          = true
+       allow_update_branch         = true
+       archive_on_destroy          = true
+       archived                    = false
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "Tests"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = true
+       has_downloads               = true
+       has_issues                  = true
+       has_projects                = true
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_BODY"
+       merge_commit_title          = "PR_TITLE"
+       name                        = "playground2"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "PR_BODY"
+       squash_merge_commit_title   = "PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = (known after apply)
+       visibility                  = "public"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
#        (1 unchanged attribute hidden)

+       security_and_analysis (known after apply)
    }

  # github_team.repo_admin_team["playground2"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the playground2 repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "playground2-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["playground2"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the playground2 repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "playground2-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["playground2"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the playground2 repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "playground2"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["playground2"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "cunla"
        }
    }

  # github_team_members.repo_team_members["playground2"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "maintainer"
+           username = "cunla"
        }
    }

  # github_team_repository.repo_admin_team_access["playground2"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "playground2"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["playground2"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "playground2"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["playground2"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "playground2"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["playground2"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 10 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #67](https://github.com/django-commons/controls/actions/runs/10442729140)